from enum import Enum

class HSVRange(tuple, Enum):
    WHITE = (((0, 0, 200), (180, 50, 255)),)
    GOLD_TEXT = (
        ((18, 120, 170), (40, 255, 255)),
        ((18, 60, 140), (45, 200, 255)),
    )
    GRAY_TO_WHITE_TEXT = (
        ((0, 0, 160), (50, 80, 255)),  # 浅灰到白色的文字范围
    )
    TEXT_HSV_RANGES = (
        # 灰白文字
        ((0, 0, 170), (50, 70, 255)),
        # 浅灰文字
        ((0, 0, 120), (50, 60, 200)),
        # 棕褐文字
        ((10, 80, 120), (25, 255, 200)),
        # 深褐文字
        ((10, 100, 50), (20, 255, 120)),
    )
